---
type: ElementIsElementTypeFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIsElementTypeFilter

`Autodesk.Revit.DB.ElementIsElementTypeFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIsElementTypeFilter | — | `` |
| Constructor | ElementIsElementTypeFilter | 2011 | `public ElementIsElementTypeFilter ()` |
| Method | PassesFilter | — | `` |